using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ComputingDevice : MonoBehaviour
{
    //オブジェクト取得の変数
    GameObject Player_1;
    GameObject Player_2;
    GameObject FourCorner1;
    GameObject FourCorner2;
    GameObject FourCorner3;
    GameObject FourCorner4;

    //四隅決定フラグ
    public bool F1flg;
    public bool F2flg;
    public bool F3flg;
    public bool F4flg;

    //他のオブジェクトのスクリプト
    Enemy EnemyScript;

    void Start()
    {
        //各オブジェクト取得
        Player_1 = GameObject.Find("Player1");
        Player_2 = GameObject.Find("Player2");
        FourCorner1 = GameObject.Find("kado1");
        FourCorner2 = GameObject.Find("kado2");
        FourCorner3 = GameObject.Find("kado3");
        FourCorner4 = GameObject.Find("kado4");

        //Enemyのスクリプト取得
        EnemyScript = GameObject.Find("Enemy").GetComponent<Enemy>();

    }

    void Update()
    {
        //------------------------------------------------------------------------------------------------------------
        //プレイヤー１のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float P1x = Player_1.transform.position.x;
        float P1y = Player_1.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //プレイヤー２のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float P2x = Player_2.transform.position.x;
        float P2y = Player_2.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角１のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F1x = FourCorner1.transform.position.x;
        float F1y = FourCorner1.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角２のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F2x = FourCorner2.transform.position.x;
        float F2y = FourCorner2.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角３のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F3x = FourCorner3.transform.position.x;
        float F3y = FourCorner3.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角４のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F4x = FourCorner4.transform.position.x;
        float F4y = FourCorner4.transform.position.y;

        //------------------------------------------------------------------------------------------------------------
        //プレイヤー1とプレイヤー2の角1との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角1のx座標 - プレイヤー1のx座標)+(角1のy座標 - プレイヤー1のy座標)の値の絶対値
        float F1P1 = (Mathf.Abs(F1x - P1x)) + (Mathf.Abs(F1y - P1y));
        //(角1のx座標 - プレイヤー2のx座標)+(角1のy座標 - プレイヤー2のy座標)の値の絶対値
        float F1P2 = (Mathf.Abs(F1x - P2x)) + (Mathf.Abs(F1y - P2y));
        //上記２つの合計値
        float F1 = F1P1 + F1P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角2との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角2のx座標 - プレイヤー1のx座標)+(角2のy座標 - プレイヤー1のy座標)の値の絶対値
        float F2P1 = (Mathf.Abs(F2x - P1x))+(Mathf.Abs(F2y - P1y));
        //(角2のx座標 - プレイヤー2のx座標)+(角2のy座標 - プレイヤー2のy座標)の値の絶対値
        float F2P2 = (Mathf.Abs(F2x - P2x))+(Mathf.Abs(F2y - P2y));
        //上記２つの合計値
        float F2 = F2P1 + F2P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角3との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角3のx座標 - プレイヤー1のx座標)+(角3のy座標 - プレイヤー1のy座標)の値の絶対値
        float F3P1 = (Mathf.Abs(F3x - P1x))+(Mathf.Abs(F3y - P1y));
        //(角3のx座標 - プレイヤー2のx座標)+(角3のy座標 - プレイヤー2のy座標)の値の絶対値    
        float F3P2 = (Mathf.Abs(F3x - P2x))+(Mathf.Abs(F3y - P2y));
        //上記２つの合計値
        float F3 = F3P1 + F3P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角4との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角4のx座標 - プレイヤー1のx座標)+(角4のy座標 - プレイヤー1のy座標)の値の絶対値
        float F4P1 = (Mathf.Abs(F4x - P1x))+(Mathf.Abs(F4y - P1y));
        //(角4のx座標 - プレイヤー2のx座標)+(角4のy座標 - プレイヤー2のy座標)の値の絶対値  
        float F4P2 = (Mathf.Abs(F4x - P2x))+(Mathf.Abs(F4y - P2y));
        //上記２つの合計値
        float F4 = F4P1 + F4P2;

        //------------------------------------------------------------------------------------------------------------
        ///上記４つの合計値を比較
        //------------------------------------------------------------------------------------------------------------
        //最大値を求める
        float max = Mathf.Max(F1, F2, F3, F4);

        if (EnemyScript.Player1Flg == false && EnemyScript.Player2Flg == false)
        {
            //F1が1番大きい
            if (max == F1)
            {
                F1flg = true;
                //F2と一緒
                if (max == F2)
                {
                    F2flg = true;
                    //F3も一緒
                    if (max == F3)
                    {
                        F3flg = true;
                        //全部一緒
                        if (max == 4)
                        {
                            F1flg = true;
                        }
                    }
                }
                //F3と一緒
                else if (max == F3)
                {
                    F3flg = true;
                }
                //F4と一緒
                else if (max == F4)
                {
                    F4flg = true;
                }
            }
            //最大がF1じゃなくなった
            else
            {
                F1flg = false;
            }

            //最大がF2
            if (max == F2)
            {
                F2flg = true;
                //F3と一緒
                if (max == F3)
                {
                    F3flg = true;
                }
                //F4と一緒
                else if (max == F4)
                {
                    F4flg = true;
                }
            }
            //最大がF2じゃなくなった
            else
            {
                F2flg = false;
            }

            //最大がF3
            if (max == F3)
            {
                F3flg = true;
                //F4と一緒
                if (max == F4)
                {
                    F4flg = true;
                }
            }
            //最大がF3じゃなくなった
            else
            {
                F3flg = false;
            }

            //最大がF4
            if (max == F4)
            {
                F4flg = true;
            }
            //最大がF4じゃなくなった
            else
            {
                F4flg = false;
            }
        }
    }
}