using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ComputingDevice : MonoBehaviour
{
    //オブジェクト取得の変数
    GameObject Player_1;
    GameObject Player_2;
    GameObject FourCorner1;
    GameObject FourCorner2;
    GameObject FourCorner3;
    GameObject FourCorner4;

    //四隅決定フラグ
    public bool F1flg;
    public bool F2flg;
    public bool F3flg;
    public bool F4flg;
    public bool F5flg;
    // Use this for initialization
    void Start()
    {
        //オブジェクト取得
        Player_1 = GameObject.Find("Player1");
        Player_2 = GameObject.Find("Player2");
        FourCorner1 = GameObject.Find("kado1");
        FourCorner2 = GameObject.Find("kado2");
        FourCorner3 = GameObject.Find("kado3");
        FourCorner4 = GameObject.Find("kado4");

    }

    // Update is called once per frame
    void Update()
    {
        //------------------------------------------------------------------------------------------------------------
        //プレイヤー１のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float P1x = Player_1.transform.position.x;
        float P1y = Player_1.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //プレイヤー２のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float P2x = Player_2.transform.position.x;
        float P2y = Player_2.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角１のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F1x = FourCorner1.transform.position.x;
        float F1y = FourCorner1.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角２のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F2x = FourCorner2.transform.position.x;
        float F2y = FourCorner2.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角３のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F3x = FourCorner3.transform.position.x;
        float F3y = FourCorner3.transform.position.y;
        //------------------------------------------------------------------------------------------------------------
        //角４のx座標とy座標を取得
        //------------------------------------------------------------------------------------------------------------
        float F4x = FourCorner4.transform.position.x;
        float F4y = FourCorner4.transform.position.y;

        //------------------------------------------------------------------------------------------------------------
        //プレイヤー1とプレイヤー2の角1との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角1のx座標 - プレイヤー1のx座標)+(角1のy座標 - プレイヤー1のy座標)の値の絶対値
        float F1P1 = (Mathf.Abs(F1x - P1x)) + (Mathf.Abs(F1y - P1y));
        //(角1のx座標 - プレイヤー2のx座標)+(角1のy座標 - プレイヤー2のy座標)の値の絶対値
        float F1P2 = (Mathf.Abs(F1x - P2x)) + (Mathf.Abs(F1y - P2y));
        //上記２つの合計値
        float F1 = F1P1 + F1P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角2との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角2のx座標 - プレイヤー1のx座標)+(角2のy座標 - プレイヤー1のy座標)の値の絶対値
        float F2P1 = (Mathf.Abs(F2x - P1x))+(Mathf.Abs(F2y - P1y));
        //(角2のx座標 - プレイヤー2のx座標)+(角2のy座標 - プレイヤー2のy座標)の値の絶対値
        float F2P2 = (Mathf.Abs(F2x - P2x))+(Mathf.Abs(F2y - P2y));
        //上記２つの合計値
        float F2 = F2P1 + F2P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角3との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角3のx座標 - プレイヤー1のx座標)+(角3のy座標 - プレイヤー1のy座標)の値の絶対値
        float F3P1 = (Mathf.Abs(F3x - P1x))+(Mathf.Abs(F3y - P1y));
        //(角3のx座標 - プレイヤー2のx座標)+(角3のy座標 - プレイヤー2のy座標)の値の絶対値    
        float F3P2 = (Mathf.Abs(F3x - P2x))+(Mathf.Abs(F3y - P2y));
        //上記２つの合計値
        float F3 = F3P1 + F3P2;

        //------------------------------------------------------------------------------------------------------------
        ///プレイヤー1とプレイヤー2の角4との距離を測る
        //------------------------------------------------------------------------------------------------------------
        //(角4のx座標 - プレイヤー1のx座標)+(角4のy座標 - プレイヤー1のy座標)の値の絶対値
        float F4P1 = (Mathf.Abs(F4x - P1x))+(Mathf.Abs(F4y - P1y));
        //(角4のx座標 - プレイヤー2のx座標)+(角4のy座標 - プレイヤー2のy座標)の値の絶対値  
        float F4P2 = (Mathf.Abs(F4x - P2x))+(Mathf.Abs(F4y - P2y));
        //上記２つの合計値
        float F4 = F4P1 + F4P2;

        //------------------------------------------------------------------------------------------------------------
        ///上記４つの合計値を比較
        //------------------------------------------------------------------------------------------------------------

        //---------------------------------------------
        float max = Mathf.Max(F1, F2, F3, F4);
        if(max == F1)
        {
            F1flg = true;
            if (max == F2)
            {
                F1flg = true;
            }
            else if (max == F3)
            {
                F1flg = true;
            }
            else if (max == F4)
            {
                F1flg = true;
            }
        }
        else
        {
            F1flg = false;
        }

        if (max == F2)
        {
            F2flg = true;
            if (max == F3)
            {
                F2flg = true;
            }
            else if (max == F4)
            {
                F2flg = true;
            }
        }
        else
        {
            F2flg = false;
        }

        if (max == F3)
        {
            F3flg = true;
            if (max == F4)
            {
                F3flg = true;
            }
        }
        else
        {
            F3flg = false;
        }

        if (max == F4)
        {
            F4flg = true;
        }
        else
        {
            F4flg = false;
        }
        //-----------------------------------------------

        ////F1が１番大きい
        //if (F1 > F2 && F1 > F3 && F1 > F4)
        //{
        //    F1flg = true;
        //}
        //else
        //{
        //    F1flg = false;
        //}
        ////F2が１番大きい
        //if (F2 > F1 && F2 > F3 && F2 > F4)
        //{
        //    F2flg = true;
        //}
        //else
        //{
        //    F2flg = false;
        //}
        ////F3が１番大きい
        //if (F3 > F1 && F3 > F2 && F3 > F4)
        //{
        //    F3flg = true;
        //}
        //else
        //{
        //    F3flg = false;
        //}
        ////F4が１番大きい
        //if (F4 > F1 && F4 > F2 && F4 > F3)
        //{
        //    F4flg = true;
        //}
        //else
        //{
        //    F4flg = false;
        //}
    }
}